cache-practice/k6-lazy-cache-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/test-lazy-cache.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 11 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m01.0s/2m00.0s

running (0m02.0s), 004/100 VUs, 37 complete and 0 interrupted iterations
default   [   2% ] 004/100 VUs  0m02.0s/2m00.0s

running (0m03.0s), 005/100 VUs, 78 complete and 0 interrupted iterations
default   [   2% ] 005/100 VUs  0m03.0s/2m00.0s

running (0m04.0s), 007/100 VUs, 135 complete and 0 interrupted iterations
default   [   3% ] 007/100 VUs  0m04.0s/2m00.0s

running (0m05.0s), 009/100 VUs, 206 complete and 0 interrupted iterations
default   [   4% ] 009/100 VUs  0m05.0s/2m00.0s

running (0m06.0s), 010/100 VUs, 294 complete and 0 interrupted iterations
default   [   5% ] 010/100 VUs  0m06.0s/2m00.0s

running (0m07.0s), 012/100 VUs, 394 complete and 0 interrupted iterations
default   [   6% ] 012/100 VUs  0m07.0s/2m00.0s

running (0m08.0s), 014/100 VUs, 507 complete and 0 interrupted iterations
default   [   7% ] 014/100 VUs  0m08.0s/2m00.0s

running (0m09.0s), 015/100 VUs, 637 complete and 0 interrupted iterations
default   [   7% ] 015/100 VUs  0m09.0s/2m00.0s

running (0m10.0s), 017/100 VUs, 794 complete and 0 interrupted iterations
default   [   8% ] 017/100 VUs  0m10.0s/2m00.0s

running (0m11.0s), 018/100 VUs, 953 complete and 0 interrupted iterations
default   [   9% ] 018/100 VUs  0m11.0s/2m00.0s

running (0m12.0s), 020/100 VUs, 1129 complete and 0 interrupted iterations
default   [  10% ] 020/100 VUs  0m12.0s/2m00.0s

running (0m13.0s), 022/100 VUs, 1316 complete and 0 interrupted iterations
default   [  11% ] 022/100 VUs  0m13.0s/2m00.0s

running (0m14.0s), 023/100 VUs, 1522 complete and 0 interrupted iterations
default   [  12% ] 023/100 VUs  0m14.0s/2m00.0s

running (0m15.0s), 025/100 VUs, 1758 complete and 0 interrupted iterations
default   [  12% ] 025/100 VUs  0m15.0s/2m00.0s

running (0m16.0s), 027/100 VUs, 1991 complete and 0 interrupted iterations
default   [  13% ] 027/100 VUs  0m16.0s/2m00.0s

running (0m17.0s), 028/100 VUs, 2239 complete and 0 interrupted iterations
default   [  14% ] 028/100 VUs  0m17.0s/2m00.0s

running (0m18.0s), 030/100 VUs, 2516 complete and 0 interrupted iterations
default   [  15% ] 030/100 VUs  0m18.0s/2m00.0s

running (0m19.0s), 032/100 VUs, 2804 complete and 0 interrupted iterations
default   [  16% ] 032/100 VUs  0m19.0s/2m00.0s

running (0m20.0s), 033/100 VUs, 3098 complete and 0 interrupted iterations
default   [  17% ] 033/100 VUs  0m20.0s/2m00.0s

running (0m21.0s), 035/100 VUs, 3415 complete and 0 interrupted iterations
default   [  17% ] 035/100 VUs  0m21.0s/2m00.0s

running (0m22.0s), 036/100 VUs, 3757 complete and 0 interrupted iterations
default   [  18% ] 036/100 VUs  0m22.0s/2m00.0s

running (0m23.0s), 038/100 VUs, 4095 complete and 0 interrupted iterations
default   [  19% ] 038/100 VUs  0m23.0s/2m00.0s

running (0m24.0s), 040/100 VUs, 4457 complete and 0 interrupted iterations
default   [  20% ] 040/100 VUs  0m24.0s/2m00.0s

running (0m25.0s), 041/100 VUs, 4847 complete and 0 interrupted iterations
default   [  21% ] 041/100 VUs  0m25.0s/2m00.0s

running (0m26.0s), 043/100 VUs, 5230 complete and 0 interrupted iterations
default   [  22% ] 043/100 VUs  0m26.0s/2m00.0s

running (0m27.0s), 045/100 VUs, 5624 complete and 0 interrupted iterations
default   [  22% ] 045/100 VUs  0m27.0s/2m00.0s

running (0m28.0s), 046/100 VUs, 6068 complete and 0 interrupted iterations
default   [  23% ] 046/100 VUs  0m28.0s/2m00.0s

running (0m29.0s), 048/100 VUs, 6485 complete and 0 interrupted iterations
default   [  24% ] 048/100 VUs  0m29.0s/2m00.0s

running (0m30.0s), 049/100 VUs, 6922 complete and 0 interrupted iterations
default   [  25% ] 049/100 VUs  0m30.0s/2m00.0s

running (0m31.0s), 050/100 VUs, 7390 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m31.0s/2m00.0s

running (0m32.0s), 051/100 VUs, 7878 complete and 0 interrupted iterations
default   [  27% ] 051/100 VUs  0m32.0s/2m00.0s

running (0m33.0s), 052/100 VUs, 8344 complete and 0 interrupted iterations
default   [  27% ] 052/100 VUs  0m33.0s/2m00.0s

running (0m34.0s), 053/100 VUs, 8819 complete and 0 interrupted iterations
default   [  28% ] 053/100 VUs  0m34.0s/2m00.0s

running (0m35.0s), 054/100 VUs, 9305 complete and 0 interrupted iterations
default   [  29% ] 054/100 VUs  0m35.0s/2m00.0s

running (0m36.0s), 054/100 VUs, 9834 complete and 0 interrupted iterations
default   [  30% ] 054/100 VUs  0m36.0s/2m00.0s

running (0m37.0s), 055/100 VUs, 10329 complete and 0 interrupted iterations
default   [  31% ] 055/100 VUs  0m37.0s/2m00.0s

running (0m38.0s), 056/100 VUs, 10832 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m38.0s/2m00.0s
time="2025-11-23T20:06:23+09:00" level=warning msg="The test has generated metrics with 100467 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m39.0s), 057/100 VUs, 11381 complete and 0 interrupted iterations
default   [  32% ] 057/100 VUs  0m39.0s/2m00.0s

running (0m40.0s), 058/100 VUs, 11880 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m40.0s/2m00.0s

running (0m41.0s), 059/100 VUs, 12425 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m41.0s/2m00.0s

running (0m42.0s), 059/100 VUs, 12971 complete and 0 interrupted iterations
default   [  35% ] 059/100 VUs  0m42.0s/2m00.0s

running (0m43.0s), 060/100 VUs, 13529 complete and 0 interrupted iterations
default   [  36% ] 060/100 VUs  0m43.0s/2m00.0s

running (0m44.0s), 061/100 VUs, 14083 complete and 0 interrupted iterations
default   [  37% ] 061/100 VUs  0m44.0s/2m00.0s

running (0m45.0s), 062/100 VUs, 14667 complete and 0 interrupted iterations
default   [  37% ] 062/100 VUs  0m45.0s/2m00.0s

running (0m46.0s), 063/100 VUs, 15260 complete and 0 interrupted iterations
default   [  38% ] 063/100 VUs  0m46.0s/2m00.0s

running (0m47.0s), 064/100 VUs, 15843 complete and 0 interrupted iterations
default   [  39% ] 064/100 VUs  0m47.0s/2m00.0s

running (0m48.0s), 064/100 VUs, 16449 complete and 0 interrupted iterations
default   [  40% ] 064/100 VUs  0m48.0s/2m00.0s

running (0m49.0s), 065/100 VUs, 17054 complete and 0 interrupted iterations
default   [  41% ] 065/100 VUs  0m49.0s/2m00.0s

running (0m50.0s), 066/100 VUs, 17680 complete and 0 interrupted iterations
default   [  42% ] 066/100 VUs  0m50.0s/2m00.0s

running (0m51.0s), 067/100 VUs, 18301 complete and 0 interrupted iterations
default   [  42% ] 067/100 VUs  0m51.0s/2m00.0s

running (0m52.0s), 068/100 VUs, 18930 complete and 0 interrupted iterations
default   [  43% ] 068/100 VUs  0m52.0s/2m00.0s

running (0m53.0s), 069/100 VUs, 19556 complete and 0 interrupted iterations
default   [  44% ] 069/100 VUs  0m53.0s/2m00.0s

running (0m54.0s), 069/100 VUs, 20211 complete and 0 interrupted iterations
default   [  45% ] 069/100 VUs  0m54.0s/2m00.0s

running (0m55.0s), 070/100 VUs, 20855 complete and 0 interrupted iterations
default   [  46% ] 070/100 VUs  0m55.0s/2m00.0s

running (0m56.0s), 071/100 VUs, 21505 complete and 0 interrupted iterations
default   [  47% ] 071/100 VUs  0m56.0s/2m00.0s

running (0m57.0s), 072/100 VUs, 22195 complete and 0 interrupted iterations
default   [  47% ] 072/100 VUs  0m57.0s/2m00.0s
time="2025-11-23T20:06:42+09:00" level=warning msg="The test has generated metrics with 200070 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m58.0s), 073/100 VUs, 22863 complete and 0 interrupted iterations
default   [  48% ] 073/100 VUs  0m58.0s/2m00.0s

running (0m59.0s), 074/100 VUs, 23533 complete and 0 interrupted iterations
default   [  49% ] 074/100 VUs  0m59.0s/2m00.0s

running (1m00.0s), 074/100 VUs, 24235 complete and 0 interrupted iterations
default   [  50% ] 074/100 VUs  1m00.0s/2m00.0s

running (1m01.0s), 075/100 VUs, 24931 complete and 0 interrupted iterations
default   [  51% ] 075/100 VUs  1m01.0s/2m00.0s

running (1m02.0s), 076/100 VUs, 25630 complete and 0 interrupted iterations
default   [  52% ] 076/100 VUs  1m02.0s/2m00.0s

running (1m03.0s), 077/100 VUs, 26349 complete and 0 interrupted iterations
default   [  52% ] 077/100 VUs  1m03.0s/2m00.0s

running (1m04.0s), 078/100 VUs, 27087 complete and 0 interrupted iterations
default   [  53% ] 078/100 VUs  1m04.0s/2m00.0s

running (1m05.0s), 079/100 VUs, 27803 complete and 0 interrupted iterations
default   [  54% ] 079/100 VUs  1m05.0s/2m00.0s

running (1m06.0s), 079/100 VUs, 28515 complete and 0 interrupted iterations
default   [  55% ] 079/100 VUs  1m06.0s/2m00.0s

running (1m07.0s), 080/100 VUs, 29298 complete and 0 interrupted iterations
default   [  56% ] 080/100 VUs  1m07.0s/2m00.0s

running (1m08.0s), 081/100 VUs, 30022 complete and 0 interrupted iterations
default   [  57% ] 081/100 VUs  1m08.0s/2m00.0s

running (1m09.0s), 082/100 VUs, 30777 complete and 0 interrupted iterations
default   [  57% ] 082/100 VUs  1m09.0s/2m00.0s

running (1m10.0s), 083/100 VUs, 31560 complete and 0 interrupted iterations
default   [  58% ] 083/100 VUs  1m10.0s/2m00.0s

running (1m11.0s), 084/100 VUs, 32328 complete and 0 interrupted iterations
default   [  59% ] 084/100 VUs  1m11.0s/2m00.0s

running (1m12.0s), 084/100 VUs, 33107 complete and 0 interrupted iterations
default   [  60% ] 084/100 VUs  1m12.0s/2m00.0s

running (1m13.0s), 085/100 VUs, 33899 complete and 0 interrupted iterations
default   [  61% ] 085/100 VUs  1m13.0s/2m00.0s

running (1m14.0s), 086/100 VUs, 34697 complete and 0 interrupted iterations
default   [  62% ] 086/100 VUs  1m14.0s/2m00.0s

running (1m15.0s), 087/100 VUs, 35479 complete and 0 interrupted iterations
default   [  62% ] 087/100 VUs  1m15.0s/2m00.0s

running (1m16.0s), 088/100 VUs, 36312 complete and 0 interrupted iterations
default   [  63% ] 088/100 VUs  1m16.0s/2m00.0s

running (1m17.0s), 089/100 VUs, 37133 complete and 0 interrupted iterations
default   [  64% ] 089/100 VUs  1m17.0s/2m00.0s

running (1m18.0s), 089/100 VUs, 37941 complete and 0 interrupted iterations
default   [  65% ] 089/100 VUs  1m18.0s/2m00.0s

running (1m19.0s), 090/100 VUs, 38771 complete and 0 interrupted iterations
default   [  66% ] 090/100 VUs  1m19.0s/2m00.0s

running (1m20.0s), 091/100 VUs, 39614 complete and 0 interrupted iterations
default   [  67% ] 091/100 VUs  1m20.0s/2m00.0s

running (1m21.0s), 092/100 VUs, 40464 complete and 0 interrupted iterations
default   [  67% ] 092/100 VUs  1m21.0s/2m00.0s

running (1m22.0s), 093/100 VUs, 41335 complete and 0 interrupted iterations
default   [  68% ] 093/100 VUs  1m22.0s/2m00.0s

running (1m23.0s), 094/100 VUs, 42216 complete and 0 interrupted iterations
default   [  69% ] 094/100 VUs  1m23.0s/2m00.0s

running (1m24.0s), 094/100 VUs, 43074 complete and 0 interrupted iterations
default   [  70% ] 094/100 VUs  1m24.0s/2m00.0s

running (1m25.0s), 095/100 VUs, 43970 complete and 0 interrupted iterations
default   [  71% ] 095/100 VUs  1m25.0s/2m00.0s

running (1m26.0s), 096/100 VUs, 44866 complete and 0 interrupted iterations
default   [  72% ] 096/100 VUs  1m26.0s/2m00.0s
time="2025-11-23T20:07:11+09:00" level=warning msg="The test has generated metrics with 400581 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (1m27.0s), 097/100 VUs, 45755 complete and 0 interrupted iterations
default   [  72% ] 097/100 VUs  1m27.0s/2m00.0s

running (1m28.0s), 098/100 VUs, 46652 complete and 0 interrupted iterations
default   [  73% ] 098/100 VUs  1m28.0s/2m00.0s

running (1m29.0s), 099/100 VUs, 47556 complete and 0 interrupted iterations
default   [  74% ] 099/100 VUs  1m29.0s/2m00.0s

running (1m30.0s), 099/100 VUs, 48466 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  1m30.0s/2m00.0s

running (1m31.0s), 097/100 VUs, 49393 complete and 0 interrupted iterations
default   [  76% ] 097/100 VUs  1m31.0s/2m00.0s

running (1m32.0s), 094/100 VUs, 50234 complete and 0 interrupted iterations
default   [  77% ] 094/100 VUs  1m32.0s/2m00.0s

running (1m33.0s), 091/100 VUs, 51107 complete and 0 interrupted iterations
default   [  77% ] 091/100 VUs  1m33.0s/2m00.0s

running (1m34.0s), 087/100 VUs, 51942 complete and 0 interrupted iterations
default   [  78% ] 087/100 VUs  1m34.0s/2m00.0s

running (1m35.0s), 084/100 VUs, 52734 complete and 0 interrupted iterations
default   [  79% ] 084/100 VUs  1m35.0s/2m00.0s

running (1m36.0s), 081/100 VUs, 53483 complete and 0 interrupted iterations
default   [  80% ] 081/100 VUs  1m36.0s/2m00.0s

running (1m37.0s), 078/100 VUs, 54222 complete and 0 interrupted iterations
default   [  81% ] 078/100 VUs  1m37.0s/2m00.0s

running (1m38.0s), 074/100 VUs, 54932 complete and 0 interrupted iterations
default   [  82% ] 074/100 VUs  1m38.0s/2m00.0s

running (1m39.0s), 071/100 VUs, 55613 complete and 0 interrupted iterations
default   [  82% ] 071/100 VUs  1m39.0s/2m00.0s

running (1m40.0s), 068/100 VUs, 56229 complete and 0 interrupted iterations
default   [  83% ] 068/100 VUs  1m40.0s/2m00.0s

running (1m41.0s), 064/100 VUs, 56864 complete and 0 interrupted iterations
default   [  84% ] 064/100 VUs  1m41.0s/2m00.0s

running (1m42.0s), 061/100 VUs, 57442 complete and 0 interrupted iterations
default   [  85% ] 061/100 VUs  1m42.0s/2m00.0s

running (1m43.0s), 058/100 VUs, 57989 complete and 0 interrupted iterations
default   [  86% ] 058/100 VUs  1m43.0s/2m00.0s

running (1m44.0s), 054/100 VUs, 58522 complete and 0 interrupted iterations
default   [  87% ] 054/100 VUs  1m44.0s/2m00.0s

running (1m45.0s), 051/100 VUs, 59009 complete and 0 interrupted iterations
default   [  87% ] 051/100 VUs  1m45.0s/2m00.0s

running (1m46.0s), 047/100 VUs, 59452 complete and 0 interrupted iterations
default   [  88% ] 047/100 VUs  1m46.0s/2m00.0s

running (1m47.0s), 044/100 VUs, 59900 complete and 0 interrupted iterations
default   [  89% ] 044/100 VUs  1m47.0s/2m00.0s

running (1m48.0s), 041/100 VUs, 60286 complete and 0 interrupted iterations
default   [  90% ] 041/100 VUs  1m48.0s/2m00.0s

running (1m49.0s), 037/100 VUs, 60660 complete and 0 interrupted iterations
default   [  91% ] 037/100 VUs  1m49.0s/2m00.0s

running (1m50.0s), 034/100 VUs, 61000 complete and 0 interrupted iterations
default   [  92% ] 034/100 VUs  1m50.0s/2m00.0s

running (1m51.0s), 031/100 VUs, 61293 complete and 0 interrupted iterations
default   [  92% ] 031/100 VUs  1m51.0s/2m00.0s

running (1m52.0s), 027/100 VUs, 61558 complete and 0 interrupted iterations
default   [  93% ] 027/100 VUs  1m52.0s/2m00.0s

running (1m53.0s), 024/100 VUs, 61802 complete and 0 interrupted iterations
default   [  94% ] 024/100 VUs  1m53.0s/2m00.0s

running (1m54.0s), 021/100 VUs, 62017 complete and 0 interrupted iterations
default   [  95% ] 021/100 VUs  1m54.0s/2m00.0s

running (1m55.0s), 018/100 VUs, 62171 complete and 0 interrupted iterations
default   [  96% ] 018/100 VUs  1m55.0s/2m00.0s

running (1m56.0s), 014/100 VUs, 62330 complete and 0 interrupted iterations
default   [  97% ] 014/100 VUs  1m56.0s/2m00.0s

running (1m57.0s), 011/100 VUs, 62441 complete and 0 interrupted iterations
default   [  97% ] 011/100 VUs  1m57.0s/2m00.0s

running (1m58.0s), 007/100 VUs, 62524 complete and 0 interrupted iterations
default   [  98% ] 007/100 VUs  1m58.0s/2m00.0s

running (1m59.0s), 004/100 VUs, 62576 complete and 0 interrupted iterations
default   [  99% ] 004/100 VUs  1m59.0s/2m00.0s

running (2m00.0s), 001/100 VUs, 62599 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  2m00.0s/2m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 125200  1043.116504/s
    checks_succeeded...: 100.00% 125200 out of 125200
    checks_failed......: 0.00%   0 out of 125200

    ✓ status is 200
    ✓ response time < 200ms

    CUSTOM
    errors.........................: 0.00%  0 out of 62600

    HTTP
    http_req_duration..............: avg=7.27ms   min=166µs    med=6.36ms   max=115.85ms p(90)=9.99ms   p(95)=12.91ms 
      { expected_response:true }...: avg=7.27ms   min=166µs    med=6.36ms   max=115.85ms p(90)=9.99ms   p(95)=12.91ms 
    http_req_failed................: 0.00%  0 out of 62600
    http_reqs......................: 62600  521.558252/s

    EXECUTION
    iteration_duration.............: avg=107.66ms min=100.23ms med=106.78ms max=216.1ms  p(90)=110.44ms p(95)=113.32ms
    iterations.....................: 62600  521.558252/s
    vus............................: 1      min=1          max=99 
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 18 MB  147 kB/s
    data_sent......................: 5.8 MB 48 kB/s



running (2m00.0s), 000/100 VUs, 62600 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s